tap "armmbed/formulae"
tap "aws/tap"
tap "brewsci/bio"
tap "common-fate/granted"
tap "fabianishere/personal"
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/test-bot"
tap "juullabs-oss/mynewt"
tap "ktemkin/oss-fpga"
tap "localsend/localsend"
tap "lucagrulla/tap"
tap "minio/stable"
tap "mistertea/et"
tap "noahgorstein/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "qmk/qmk"
tap "riscv-software-src/riscv"
tap "sidneys/homebrew"
tap "tgtakaoka/mspgcc"
tap "ynqa/tap"
brew "ack"
brew "act"
brew "aircrack-ng"
brew "gettext"
brew "harfbuzz"
brew "xz"
brew "zstd"
brew "little-cms2"
brew "ant"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "grpc"
brew "z3"
brew "apache-arrow"
brew "apktool"
brew "aria2"
brew "autoconf"
brew "automake"
brew "coreutils"
brew "libtool"
brew "asdf"
brew "dbus"
brew "at-spi2-core"
brew "python@3.12"
brew "atkmm@2.28"
brew "autoconf-archive"
brew "boost"
brew "libusb"
brew "libftdi"
brew "avrdude"
brew "cffi"
brew "cryptography"
brew "awscli"
brew "libuv"
brew "balena-cli"
brew "bash"
brew "bash-completion"
brew "htslib"
brew "bcftools"
brew "berkeley-db", link: true
brew "binutils"
brew "gcc"
brew "libraqm"
brew "numpy"
brew "p7zip"
brew "pillow"
brew "python@3.11"
brew "binwalk"
brew "bison"
brew "boost-python3"
brew "btop"
brew "bzip2"
brew "cabextract"
brew "cairomm@1.14"
brew "catch2"
brew "ccache"
brew "cdrtools"
brew "eigen"
brew "suite-sparse"
brew "ceres-solver"
brew "cfn-lint"
brew "pkgconf"
brew "hdf5"
brew "check"
brew "clfft"
brew "cloudflared"
brew "cmake"
brew "ripgrep"
brew "codex"
brew "cppcheck"
brew "curl"
brew "datasette"
brew "dfu-util"
brew "diffutils"
brew "dockutil"
brew "docutils"
brew "dos2unix"
brew "doxygen"
brew "dsq"
brew "ed"
brew "node"
brew "emscripten"
brew "libgit2"
brew "exa"
brew "exiftags"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "libmicrohttpd"
brew "librist"
brew "libsndfile"
brew "pango"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "pmix"
brew "open-mpi"
brew "fftw"
brew "findutils"
brew "flann"
brew "flex"
brew "fonttools", link: false
brew "fx"
brew "gawk"
brew "libavif"
brew "gd"
brew "gdk-pixbuf"
brew "geckodriver"
brew "gh"
brew "ghostscript"
brew "git"
brew "git-lfs"
brew "gkrellm"
brew "glfw"
brew "gsettings-desktop-schemas"
brew "glib-networking"
brew "glibmm"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "libgpg-error"
brew "libassuan"
brew "gnupg"
brew "go"
brew "gobject-introspection"
brew "goreleaser"
brew "gperftools"
brew "gradle"
brew "openssl@1.1"
brew "python@3.9"
brew "graphene"
brew "netpbm"
brew "librsvg"
brew "graphviz"
brew "gtk+3"
brew "gtk4"
brew "libpsl"
brew "libsoup"
brew "py3cairo"
brew "pygobject3"
brew "gstreamer"
brew "pangomm@2.46"
brew "gtkmm3"
brew "guile"
brew "gzip"
brew "hashcat"
brew "helm"
brew "perl"
brew "help2man"
brew "htop"
brew "httpie"
brew "libimobiledevice"
brew "libzip"
brew "ideviceinstaller"
brew "igv"
brew "imagemagick"
brew "jadx"
brew "jbang"
brew "jenv"
brew "jq"
brew "jqp"
brew "latex2html"
brew "lbzip2"
brew "lftp"
brew "libelf"
brew "libfido2"
brew "libmng"
brew "libngspice"
brew "libproxy"
brew "libsigrok"
brew "python@3.10"
brew "libsigrokdecode"
brew "libslirp"
brew "libxmlsec1"
brew "links"
brew "llvm@13"
brew "localstack"
brew "lsusb"
brew "macvim", link: false
brew "maven"
brew "ninja"
brew "meson"
brew "minio"
brew "mosh"
brew "mpack"
brew "mutt"
brew "mysql"
brew "nasm"
brew "netcat"
brew "netcdf"
brew "nghttp2"
brew "ngspice"
brew "nim"
brew "nmap"
brew "node@14"
brew "nushell"
brew "oath-toolkit"
brew "oci-cli"
brew "open-ocd", args: ["HEAD"]
brew "openjdk@11"
brew "openapi-generator"
brew "opencode"
brew "openvino"
brew "qt"
brew "pyqt"
brew "vtk"
brew "opencv"
brew "pandoc"
brew "parallel"
brew "parquet-tools"
brew "pass"
brew "pass-otp"
brew "pbzip2"
brew "pcl"
brew "pdftohtml"
brew "pgpdump"
brew "picard-tools"
brew "pigz"
brew "pinentry-mac"
brew "pipx"
brew "pixi", args: ["HEAD"]
brew "portaudio"
brew "pre-commit"
brew "pv"
brew "pwgen"
brew "pybind11"
brew "pyqt@5"
brew "python@3.8"
brew "qemu"
brew "ruby-build"
brew "rbenv"
brew "rbenv-chefdk"
brew "rclone"
brew "reattach-to-user-namespace"
brew "ripgrep-all"
brew "rpm2cpio"
brew "ruby@3.0"
brew "rustup"
brew "samtools"
brew "sccache"
brew "scons"
brew "screen"
brew "sdcc"
brew "sigrok-cli"
brew "sip"
brew "sniffnet"
brew "sphinx-doc"
brew "spoof-mac"
brew "squashfs"
brew "srecord"
brew "ssh-copy-id"
brew "sshuttle"
brew "stlink"
brew "subversion"
brew "swig"
brew "tailscale", link: false
brew "telnet"
brew "terraform"
brew "tmux"
brew "travis"
brew "unicorn"
brew "unshield"
brew "uv"
brew "uvicorn"
brew "vtk@8.2"
brew "vue-cli"
brew "wabt"
brew "watch"
brew "wdiff"
brew "weasyprint"
brew "webpack"
brew "wget"
<<<<<<< Updated upstream
brew "wimlib"
brew "wireguard-tools"
brew "xsv"
brew "yaml-cpp"
=======
brew "wireshark"
brew "sniffnet"
brew "wireshark-chmodbpf"
brew "tailscale"
brew "heroku/brew/heroku"
>>>>>>> Stashed changes
brew "yosys", args: ["HEAD"]
brew "yq"
brew "yt-dlp"
brew "z"
brew "zig"
brew "zola"
brew "armmbed/formulae/arm-none-eabi-gcc"
brew "brewsci/bio/sdsl-lite"
brew "common-fate/granted/granted"
brew "fabianishere/personal/pam_reattach"
brew "heroku/brew/heroku"
brew "ktemkin/oss-fpga/icestorm", args: ["HEAD"]
brew "ktemkin/oss-fpga/nextpnr-ice40", args: ["HEAD"]
brew "minio/stable/mc"
brew "osx-cross/arm/arm-gcc-bin@14"
brew "osx-cross/avr/avr-binutils"
brew "osx-cross/avr/avr-gcc@12"
brew "osx-cross/avr/avr-gdb"
brew "sidneys/homebrew/unrar"
brew "ynqa/tap/jnv"
cask "adium"
cask "adobe-acrobat-reader"
cask "amethyst"
cask "android-commandlinetools"
cask "android-ndk"
cask "android-platform-tools"
cask "android-studio"
cask "anki"
cask "arduino"
cask "audacity"
cask "balenaetcher"
cask "betterdisplay"
cask "blackhole-2ch"
cask "blackhole-64ch"
cask "blender"
cask "brave-browser"
cask "burp-suite"
cask "calibre"
cask "chromedriver"
cask "clion"
cask "cloudflare-warp"
cask "coolterm"
cask "corretto"
cask "craft"
cask "datagrip"
cask "dbeaver-community"
cask "dotnet-sdk"
cask "drop-to-gif"
cask "eclipse-ide"
cask "element"
cask "firefox"
cask "font-fira-code"
cask "font-jetbrains-mono"
cask "freecad"
cask "freetube"
cask "gdisk"
cask "gimp"
cask "github@beta"
cask "google-chrome"
cask "gtkwave"
cask "imhex"
cask "inkscape"
cask "intellij-idea"
cask "intellij-idea-ce"
cask "iterm2"
cask "keybase"
cask "keymapp"
cask "kicad"
cask "libreoffice"
cask "little-snitch"
cask "localsend"
cask "ltspice"
cask "lulu"
cask "macvim-app"
cask "megasync"
cask "miniconda"
cask "monitorcontrol"
cask "mullvad-browser"
cask "notion"
cask "obs"
cask "obs-virtualcam"
cask "ollama-app"
cask "openboardview"
cask "openscad"
cask "postman"
cask "prusaslicer"
cask "pycharm"
cask "pycharm-ce"
cask "r-app"
cask "raspberry-pi-imager"
cask "rustrover"
cask "send-to-kindle"
cask "session-manager-plugin"
cask "skitch"
cask "slack"
cask "slic3r"
cask "stats"
cask "steam"
cask "tailscale-app"
cask "telegram"
cask "tor-browser"
cask "transmission"
cask "ultimaker-cura"
cask "visual-studio-code@insiders"
cask "vlc"
cask "voiceink"
cask "wireshark-app"
cask "xpra"
cask "xquartz"
cask "yubico-yubikey-manager"
cask "zed"
cask "zulip"
cask "zulu@11"
vscode "asabil.meson"
vscode "belfz.search-crates-io"
vscode "bierner.markdown-mermaid"
vscode "carlomaragno.sleighighlight"
vscode "charliermarsh.ruff"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "fill-labs.dependi"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.terraform"
vscode "lextudio.restructuredtext"
vscode "lramseyer.vaporview"
vscode "marus25.cortex-debug"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "panicbit.cargo"
vscode "probe-rs.probe-rs-debugger"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "rust10x.rust10x"
vscode "tamasfe.even-better-toml"
vscode "trond-snekvik.simple-rst"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "wokwi.wokwi-vscode"
vscode "yzhang.markdown-all-in-one"
vscode "zxh404.vscode-proto3"
