tap "armmbed/formulae"
tap "aws/tap"
tap "fabianishere/personal"
tap "filosottile/musl-cross"
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/test-bot"
tap "juullabs-oss/mynewt"
tap "koekeishiya/formulae"
tap "ktemkin/oss-fpga"
tap "lucagrulla/tap"
tap "mistertea/et"
tap "tgtakaoka/mspgcc"
brew "ack"
brew "ant"
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "xz"
brew "awscli"
brew "node"
brew "balena-cli"
brew "bash-completion"
brew "libusb"
brew "bettercap"
brew "bison"
brew "boost"
brew "bzip2"
brew "cabextract"
brew "glib"
brew "check"
brew "cmake"
brew "coreutils"
brew "binutils"
brew "curl"
brew "dfu-util"
brew "dockutil"
brew "doxygen"
brew "libtool"
brew "pkg-config"
brew "exiftags"
brew "ffmpeg"
brew "flex"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "glibmm"
brew "gnu-sed"
brew "go"
brew "goreleaser"
brew "gperftools"
brew "gradle"
brew "graphviz"
brew "gzip"
brew "hashcat"
brew "help2man"
brew "htop"
brew "jadx"
brew "jenv"
brew "jq"
brew "jsawk"
brew "lbzip2"
brew "lftp"
brew "libelf"
brew "libftdi"
brew "libngspice"
brew "libzip"
brew "lsusb"
brew "mas"
brew "maven"
brew "mosh"
brew "mysql"
brew "ngspice"
brew "ninja"
brew "nmap"
brew "nushell"
brew "oci-cli"
brew "pandoc"
brew "parallel"
brew "parquet-tools"
brew "pass"
brew "pass-otp"
brew "pbzip2"
brew "pigz"
brew "pinentry-mac"
brew "pv"
brew "pwgen"
brew "qt"
brew "r"
brew "rbenv-chefdk"
brew "rclone"
brew "rpm2cpio"
brew "rustup-init"
brew "samtools"
brew "sccache"
brew "sdcc"
brew "squashfs"
brew "ssh-copy-id", link: true
brew "sshuttle"
brew "stlink"
brew "swig"
brew "telnet"
brew "terraform", args: ["build-from-source"]
brew "tmux"
brew "travis"
brew "watch"
brew "wget"
brew "wireshark"
brew "yosys", args: ["HEAD"]
brew "youtube-dl"
brew "zlib"
brew "armmbed/formulae/arm-none-eabi-gcc"
brew "aws/tap/aws-sam-cli"
brew "fabianishere/personal/pam_reattach"
brew "filosottile/musl-cross/musl-cross"
brew "juullabs-oss/mynewt/mynewt-newt"
brew "ktemkin/oss-fpga/icestorm", args: ["HEAD"]
brew "ktemkin/oss-fpga/nextpnr-ice40", args: ["HEAD"]
brew "lucagrulla/tap/cw"
brew "mistertea/et/et"
cask "amethyst"
cask "arduino"
cask "balenaetcher"
cask "google-chrome"
cask "firefox"
cask "chromedriver"
cask "zulu11"
cask "stats"
cask "discord"
cask "docker-edge"
cask "dotnet-sdk"
cask "gimp"
cask "google-cloud-sdk"
cask "gtkwave"
cask "igv"
cask "inkscape"
cask "kicad"
cask "ltspice"
cask "macvim"
cask "megasync"
cask "miniconda"
cask "monitorcontrol"
cask "nordic-nrf-command-line-tools"
cask "obs"
cask "obs-virtualcam"
cask "openscad"
cask "pycharm-ce"
cask "sdformatter"
cask "segger-jlink"
cask "session-manager-plugin"
cask "steam"
cask "transmission"
cask "ultimaker-cura"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "vlc"
cask "eclipse-ide"
cask "visual-studio-code-insiders"
cask "intellij-idea-ce"
cask "slack"
cask "telegram"
cask "signal"
cask "zulip"
cask "discord"
cask "iterm2"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "WireGuard", id: 1451685025
